# Enabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonPanel..::..Enabled Property
RibbonPanel Class See Also
---
Gets or sets a value indicating whether the RibbonPanel can respond to user interaction.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Enabled { get; set; }
```

Visual Basic
---
```text
Public Property Enabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Enabled {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if the panel allows interaction, false if the panel disallows interaction with all the controls it contains.
# See Also
RibbonPanel Class
Autodesk.Revit.UI Namespace